{
  "0": {
    "title": "Tony's Childhood",
    "text": "Hello! This is Tony Chen. I was born in Beijing on Nov,5th,1997. My Chinese name is Yuhang Chen(陈宇航). My grandpa named me Yuhang and it means universe travel. My dad was an aircraft mechanical engineer and China was designing their first Rocket, so my grandpa hopes I can be an Astronaut. (Obviously it is not possible since I wear glasses in middle school lol). \n\nI grow up in my grandparents' house in Beijing for 18 years. My grandparents were soldiers, so my house was in an army compound. I felt blessed to live with my grandparents. I made many good friends and I learned many good virtues from my grandparents -- honest, upright, loyal, friendly, kind, etc. \nBeijing is a very historical and cultural city, I grow up visiting the Forbidden City, the Great Wall, the Summer Palace, etc. Chinese school taught me a lot about Confucius thinking and Chinese history with traditional thinking. They helped me to form views on the world, life, and values. \n\nBeijing is also a modern city. I love going to the shopping mall with my friends. We can watch movies, sing karaoke, eat at restaurants. I was influenced by my parents, so I am a huge foodie. The only thing I care about during my travel is the new food I can try! I grow up playing basketball and soccer. I went to the 2008 Olympic basketball final between the USA and Spain. The Wukesong Stadium was only 3 blocks away from my home!"
  },
  "1": {
    "title": "Kaitlin's Childhood",
    "text": "this is Kaitlin"
  },
  "2": {
    "title": "How We Met",
    "text": "The first time we met is at the CS160 Lecture which was taught by Professor Jennifer. However, we didn't know each other and never talked during the class.\n\nIn the Fall of 2018, I joined the Christian Co-op house -- Courtyard. We started to get to know each other more by living in the same co-op house. We went to a lot of house events together -- Basketball game, Football game, winter retreat, prom night. Since we are both Computer Science students, we study for class and work on projects together. \n\nIn the summer of 2019, we both went to a summer internship in Portland at different companies. Through the events and study together, we were very close as friends. I love sharing the Chinese culture, food, and ideas with Kaitlin. Kaitlin loves explaining the American culture and thinks to me"
  },
  "3": {
    "title": "Our first date",
    "text": "Chinese new year"
  },
  "4": {
    "title": "The purposal story",
    "text": "Mt.Psgah"
  }
}
