{
  "0": {
    "title": "Tony's Childhood",
    "text": "Hello! This is Tony Chen. I was born in Beijing on Nov,5th,1997. My Chinese name is Yuhang Chen(陈宇航). My grandpa named me Yuhang and it means universe travel. My dad was an aircraft mechanical engineer and China was designing their first Rocket, so my grandpa hopes I can be an Astronaut. (Obviously it is not possible since I wear glasses in middle school lol). \n\nI grow up in my grandparents' house in Beijing for 18 years. My grandparents were soldiers, so my house was in an army compound. I felt blessed to live with my grandparents. I made many good friends and I learned many good virtues from my grandparents -- honest, upright, loyal, friendly, kind, etc. \nBeijing is a very historical and cultural city, I grow up visiting the Forbidden City, the Great Wall, the Summer Palace, etc. Chinese school taught me a lot about Confucius thinking and Chinese history with traditional thinking. They helped me to form views on the world, life, and values. \n\nBeijing is also a modern city. I love going to the shopping mall with my friends. We can watch movies, sing karaoke, eat at restaurants. I was influenced by my parents, so I am a huge foodie. The only thing I care about during my travel is the new food I can try! I grow up playing basketball and soccer. I went to the 2008 Olympic basketball final between the USA and Spain. The Wukesong Stadium was only 3 blocks away from my home!"
  },
  "1": {
    "title": "Kaitlin's Childhood",
    "text": "Kaitlin was born in Eugene, Oregon and grew up in the area. She loves being an Oregonian. Growing up, she played lots of different sports, camp, hike, and go on vacation with her family. Her biggest passion growing up was dancing and singing. In all, she danced for 11 years. In high school, she was part of jazz choir and school musicals.\n\nKaitlin also loves Disney and going to Disneyland with her family. In high school, she got to dance at Disneyland. Her favorite ride is Thunder Mountain Railroad. She loves all types of rides though. The feature that is most special about Disneyland is the feel. It always provides a magical atmosphere. \n\nKaitlin loves the beach. Growing up, her family went camping at the coast every year. She loves walking on the beach. The Oregon coast is special because you can walk for miles on nice white sand beach. She also loves seeing all the different light houses at the coast. Many towns have different lighthouses that are all a little different from each other. Also, every coastal town has their own little shopping area. She loves browsing the different shops. They all have their own unique features. \n\nKaitlin is close with her family. She has two brothers and lots of cousins. Her family always did lots growing up. They would go camping, hiking, Disneyland, and more. She is so thankful for her family and all the support they provided her growing up."
  },
  "2": {
    "title": "How We Met",
    "text": "The first time we met is at the CS160 Lecture which was taught by professor Jennifer. However, we didn't know and talked to each other during the class.\n\nIn the Fall of 2018, I joined the Christian Co-op house -- Courtyard. We started to know each other more by living in the same co-op house. We went to a lot of house events together -- Basketball game, Football game, Winter retreat, Prom night. Since we are both Computer Science students, we study for classes and work on projects together. \n\nIn the summer of 2019, we both went to a summer internship in Portland at different companies. Through the events and study together, we became very close as friends. I love sharing the Chinese culture, food, and thinking with Kaitlin, and Kaitlin loves explaining the American culture and ideas to me.\n\nCourtyard Relevance is an amazing Christian Co-op house. It provided a great environment to study, a good platform to socialize, and many amazing chances to learn about God. I made many life-time friends here and I found Kaitlin here! Courtyard slogan is 'Where life is found', a lot of us think it's 'Where wife is found'"
  },
  "3": {
    "title": "Our First Date",
    "text": "After did many group events together, I decided to ask Kaitlin out for a date. The date was close to the 2020 Chinese New year, so I think the Chinese New Year Gala at school will be a good event. \n\nChinese culture is mild and shy, so I didn't directly tell Kaitlin it is a date but provided many hints. First, I asked if Kaitlin wants to go to the gala with me and she said yes. Second, I bought two tickets and took of picture of them. I texted her the picture of two tickets and said -- 'I am excited to go to the Chinese New Year Gala with you!'. After that, I made a good surprise for her. I wrote a letter to her and I hide the letter and a panda artwork made by my grandma in the CS TA office at Kelley Engineer Center. (A place where we study and work a lot). I planned to take her to the TA office after the Gala.\n\nI thought that I provided enough hints, however, Kaitlin didn't act as she knew. On the day of the gala, 5 mins before our leave time, she ran back to the house after her group project meeting. She showed up at the front door right on time without wearing any makeup. I started to worry about if she was interested in me since she didn't dress fancy or wear any makeup for this fun event. It turns out that she didn't know this would be a date at all, she was awkward and wonder why there were only 2 people show up for this event instead of a group. Later on, she told me that she saw the ticket price is 5 dollars base on the picture I sent to her, she thought the picture is the proof of the money she owns me, and she can reimburse me later. \n\nAnyway, the night went well and the gala was pretty fun! One the way home after the gala, I asked her two questions.\nT: 'Do you like the Chinese Spring Gala tonight?'\nK: 'Yes, I like it!'. \nT: 'So do you like the Chinese guy like me?' \nShe was surprised when she heard the question.\nK: 'Do you mean you like me?'\nT: 'Yes! Among many pretty girls I saw, you are the smartest one. Among many smart girls I saw, you are the prettiest one!'\nK: 'hmmm. I don't know, I need to think.'\nKaitlin was very shy and she told me that she had to think about it. \n\nAfter 3 days of thinking, Kaitlin asked me to take a walk. She told me that she is interested in me too! I was very happy and I read the letter to her. After that, we went on a road trip to In-N-Out."
  },
  "4": {
    "title": "The Proposal Story",
    "text": "In January of 2021, I decided to purpose Kaitlin in February. I started doing research and hiked around Corvallis and Eugene. I picked Mt.Pisgah since the view is beautiful and it is close to Kaitlin's house. \n\nOn February,13th Saturday, We decided to hike Mt.Pisgah with her family. It was a rainy day and the hike was rough. It took us 1 hour to get to the top. Luckily, God blessed us with sunshine when we get to the top, and the view was gorgeous. \n\nAfter rest for a few minutes, I put my knew down in front of Kaitlin and said:\n'It took me 8888km (5500 miles) from Beijing to Oregon to meet you.\nIt took me 4 years in college to find you.\nIt took me 2 years to realize you are the angel that God sent me.\nYou are the one I wish to spend the rest of my life with!\nI love you! Kaitlin! Will you marry me?'\n\nShe said: 'Yes, I do!'"
  }
}
